//1) 分治法是一种很重要的算法。字面上的解释是“分而治之”，就是把一个复杂的问题分成两个或更多的相同或
//相似的子问题，再把子问题分成更小的子问题……直到最后子问题可以简单的直接求解，原问题的解即子问题
//的解的合并。这个技巧是很多高效算法的基础，如排序算法(快速排序，归并排序)，傅立叶变换(快速傅立叶变换)……
//2) 分治算法可以求解的一些经典问题
// 二分搜索 大整数乘法 棋盘覆盖 合并排序 快速排序 线性时间选择 最接近点对问题 循环赛日程表 汉诺塔
//分治法在每一层递归上都有三个步骤：
//        1) 分解：将原问题分解为若干个规模较小，相互独立，与原问题形式相同的子问题
//        2) 解决：若子问题规模较小而容易被解决则直接解，否则递归地解各个子问题
//        3) 合并：将各个子问题的解合并为原问题的解。
//还是没看懂,但是背下来了
package com.shh;
public class Day18分治算法解决汉诺塔 {
    public static void main(String[] args) {
        hanoitower(4, 'A','B','C');
    }
    //将汉诺塔始终看成最下层和其上部两个部分
    public static void hanoitower(int num, char a, char b, char c)
    {
        if(num==1)//最底层的步骤
        {
            System.out.println("第1个盘"+a+"->"+c);
        }
        else
        {
            hanoitower(num-1,a,c,b);//借助c将a移动到b
            System.out.println("第"+num+"个盘"+a+"->"+c);
            hanoitower(num-1,b,a,c);//借助a将b移动到c
        }
    }
}
